In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.DataFrame(
    {
        'id':[1,2],
        'store_nbr': [1,2],
        'family': ['POULTRY','PRODUCE']
    }
)

   id  store_nbr   family
0   1          1  POULTRY
1   2          2  PRODUCE

In [3]:
oil = pd.read_csv('retail/oil.csv')

In [35]:
path_retail = "retail/retail_2016_2017.csv"
retail = pd.read_csv(path_retail)

In [4]:
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [5]:
oil.shape

(1218, 2)

In [6]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [7]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [8]:
oil.columns = ['price date','oil price']

In [9]:
oil

      price date  oil price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [10]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['price date', 'oil price'], dtype='object')]

In [11]:
oil.dtypes

price date     object
oil price     float64
dtype: object

In [12]:
oil.head()

   price date  oil price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [13]:
oil.head(6)

   price date  oil price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20
5  2013-01-08      93.21

In [14]:
oil.sample(5)

     price date  oil price
218  2013-11-01      94.56
490  2014-11-18      74.55
62   2013-03-28      97.24
470  2014-10-21      83.25
633  2015-06-05      59.11

In [15]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price date  1218 non-null   object
 1   oil price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [16]:
oil.describe()

         oil price
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

In [17]:
oil.describe().loc['std','oil price']

25.630475729453224

In [18]:
oil.sample(5, random_state=12345)

      price date  oil price
656   2015-07-08      51.61
502   2014-12-04      66.73
111   2013-06-05      93.66
1134  2017-05-08      46.46
931   2016-07-27      41.90

In [19]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price date  1218 non-null   object
 1   oil price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [20]:
oil.describe(include='all').round()

        price date  oil price
count         1218     1175.0
unique        1218        NaN
top     2013-01-01        NaN
freq             1        NaN
mean           NaN       68.0
std            NaN       26.0
min            NaN       26.0
25%            NaN       46.0
50%            NaN       53.0
75%            NaN       96.0
max            NaN      111.0

In [21]:
oil

      price date  oil price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [26]:
oil.columns = ['price_date','oil_price']

In [28]:
oil.price_date

0       2013-01-01
1       2013-01-02
2       2013-01-03
3       2013-01-04
4       2013-01-07
           ...
1213    2017-08-25
1214    2017-08-28
1215    2017-08-29
1216    2017-08-30
1217    2017-08-31
Name: price_date, Length: 1218, dtype: object

In [31]:
oil['price_date'].iloc[:5]

0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
4    2013-01-07
Name: price_date, dtype: object

In [36]:
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [45]:
retail[['family','store_nbr']] # return dataframe

                             family  store_nbr
0                        AUTOMOTIVE          1
1                         BABY CARE          1
2                            BEAUTY          1
3                         BEVERAGES          1
4                             BOOKS          1
...                             ...        ...
1054939                     POULTRY          9
1054940              PREPARED FOODS          9
1054941                     PRODUCE          9
1054942  SCHOOL AND OFFICE SUPPLIES          9
1054943                     SEAFOOD          9

[1054944 rows x 2 columns]

In [44]:
retail[['family']] # return dataframe by passing a list as argument

                             family
0                        AUTOMOTIVE
1                         BABY CARE
2                            BEAUTY
3                         BEVERAGES
4                             BOOKS
...                             ...
1054939                     POULTRY
1054940              PREPARED FOODS
1054941                     PRODUCE
1054942  SCHOOL AND OFFICE SUPPLIES
1054943                     SEAFOOD

[1054944 rows x 1 columns]

In [43]:
retail['family'] # return series

0                          AUTOMOTIVE
1                           BABY CARE
2                              BEAUTY
3                           BEVERAGES
4                               BOOKS
                      ...
1054939                       POULTRY
1054940                PREPARED FOODS
1054941                       PRODUCE
1054942    SCHOOL AND OFFICE SUPPLIES
1054943                       SEAFOOD
Name: family, Length: 1054944, dtype: object

In [49]:
retail.iloc[:5,1:4] #first 5 rows, 2-4 columns

         date  store_nbr      family
0  2016-01-01          1  AUTOMOTIVE
1  2016-01-01          1   BABY CARE
2  2016-01-01          1      BEAUTY
3  2016-01-01          1   BEVERAGES
4  2016-01-01          1       BOOKS

In [50]:
retail.loc[:,'date']

0          2016-01-01
1          2016-01-01
2          2016-01-01
3          2016-01-01
4          2016-01-01
              ...
1054939    2017-08-15
1054940    2017-08-15
1054941    2017-08-15
1054942    2017-08-15
1054943    2017-08-15
Name: date, Length: 1054944, dtype: object

In [52]:
retail.loc[:,['date']]

               date
0        2016-01-01
1        2016-01-01
2        2016-01-01
3        2016-01-01
4        2016-01-01
...             ...
1054939  2017-08-15
1054940  2017-08-15
1054941  2017-08-15
1054942  2017-08-15
1054943  2017-08-15

[1054944 rows x 1 columns]

In [54]:
retail.loc[:,'date':'sales']

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [55]:
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [57]:
oil.iloc[:10,0:1]

   price_date
0  2013-01-01
1  2013-01-02
2  2013-01-03
3  2013-01-04
4  2013-01-07
5  2013-01-08
6  2013-01-09
7  2013-01-10
8  2013-01-11
9  2013-01-14

In [60]:
oil.iloc[:10,[-1]]

   oil_price
0        NaN
1      93.14
2      92.97
3      93.12
4      93.20
5      93.21
6      93.08
7      93.81
8      93.60
9      94.27

In [61]:
oil.iloc[:10,-2:-1]

   price_date
0  2013-01-01
1  2013-01-02
2  2013-01-03
3  2013-01-04
4  2013-01-07
5  2013-01-08
6  2013-01-09
7  2013-01-10
8  2013-01-11
9  2013-01-14

In [68]:
oil.loc[0:5,:] # loc last row inclusive

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20
5  2013-01-08      93.21

In [67]:
oil.iloc[0:5,:] # iloc last row exclusive

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20